Revit 2027 API
BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatWarning Property
 The resulting angle between the segments is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SegmentsAngleTooGreatWarning { get; }
Public Shared ReadOnly Property SegmentsAngleTooGreatWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SegmentsAngleTooGreatWarning {
	FailureDefinitionId^ get ();
}
static member SegmentsAngleTooGreatWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace